It happens all the time: someone gives you data containing malformed strings,  Python, lists and missing data. How do you tidy it up so you can get on with the  analysis? 
Take this monstrosity as the DataFrame to use in the following puzzles: 
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',  
'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']}) 
1. Some values in the the FlightNumber column are missing. These numbers are  meant to increase by 10 with each row so 10055 and 10075 need to be put in  place. Fill in these missing numbers and make the column an integer column  (instead of a float column). 
2. The From_To column would be better as two separate columns! Split each  string on the underscore delimiter _ to give a new temporary DataFrame with  the correct values. Assign the correct column names to this temporary  DataFrame. 
3. Notice how the capitalisation of the city names is all mixed up in this  temporary DataFrame. Standardise the strings so that only the first letter is  uppercase (e.g. "londON" should become "London".) 
4. Delete the From_To column from df and attach the temporary DataFrame  from the previous questions.

In [346]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [347]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

Some values in the the FlightNumber column are missing. 
These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and
make the column an integer column (instead of a float column).

In [348]:
#Filling missing values :method 1
x=df.FlightNumber[0] # assuming the 0 th index value of df.flightNumber
for i in range(len(df.FlightNumber)):
    df.FlightNumber[i]=x
    x=x+10 # incrementing with 10
df.FlightNumber

C:\Users\rajeshkc\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [349]:
##filling missing values :method 2
#df.FlightNumber.fillna(value=df.FlightNumber[0]+10,limit=1,inplace=True)
#df.FlightNumber.fillna(value=df.FlightNumber[2]+10,limit=1,inplace=True)
#df.FlightNumber[2].fillna(value=df.FlightNumber[2]+10,inplace=True)
df.FlightNumber

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [350]:
df.FlightNumber=df.FlightNumber.astype(np.int64)

In [351]:
df.FlightNumber.dtype

dtype('int64')

The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. 
Assign the correct column names to this temporary DataFrame.

In [352]:
#Splitting From_To column into From and To columns
From=[]
To=[]
for j in range(len(df.From_To)):
    From.append(df.From_To[j].split(sep='_')[0])
    To.append(df.From_To[j].split(sep='_')[1])
#creating list 
To= [i.capitalize() for i in To] 

From=[i.capitalize() for i in From]

In [353]:
temp_df=pd.DataFrame()

In [354]:

temp_df['From']=From  #Creating pandas series using the list From

In [355]:
temp_df['To']=To #Creating pandas series using the list To

In [356]:
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [357]:
df=df.drop(columns=['From_To'],axis=1)
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []                 (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [358]:
df=pd.merge(df,temp_df,left_index=True, right_index=True)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []                 (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the  DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value  should be NaN. 
Expand the Series of lists into a DataFrame named delays, rename the columns  delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df  with delays.

In [359]:
a=list(df.RecentDelays)

In [360]:
df3=pd.DataFrame(a)
df['delay_1']=df3[0]
df['delay_2']=df3[1]
df['delay_3']=df3[2]

In [361]:
df.columns

Index(['FlightNumber', 'RecentDelays', 'Airline', 'From', 'To', 'delay_1',
       'delay_2', 'delay_3'],
      dtype='object')

In [362]:
df=df[['From', 'To','FlightNumber', 'delay_1',
       'delay_2', 'delay_3','Airline']]

In [330]:
df

,From,To,FlightNumber,delay_1,delay_2,delay_3,Airline
0,London,Paris,10045,23.0,47.0,NaN,KLM(!)
1,Madrid,Milan,10055,NaN,NaN,NaN,(12)
2,London,Stockholm,10065,24.0,43.0,87.0,(British Airways. )
3,Budapest,Paris,10075,13.0,NaN,NaN,12. Air France
4,Brussels,London,10085,67.0,32.0,NaN,"""Swiss Air"""